:PROPERTIES:
:ID:       936dd23a-681a-44ad-8d56-30b462d79d22
:END:
#+TITLE: Notes on Structure and Interpretation of Computer Programs by Sussman, Sussman, and Abelson
#+FILETAGS: :fleeting:mm:
#+SETUPFILE: ~/.config/emacs/setup/setupfile.org
#+BEGIN: clocktable :maxlevel 2 :scope nil :emphasize nil
#+END:
* Building Abstractions with Procedures
  :LOGBOOK:
  CLOCK: [2021-11-07 Sun 00:54]--[2021-11-07 Sun 01:05] =>  0:11
  CLOCK: [2021-07-13 Tue 16:29]--[2021-07-13 Tue 16:45] =>  0:16
  :END:
- computational process :: abstract beings that inhabit computers. As they evolve, processes manipulate other abstract things called /data/. The evolution of a process is directed by a pattern of rules called a /program/. They are carefully composed from symbolic expressions in arcane and esoteric /programming languages/ that prescribe the tasks we want our processes to perform.
Master software engineers have the following traits:
1. the ability to organize programs so that they can be reasonably sure that the resulting processes will perform the tasks intended.
2. the ability to visualize the behaviour of their systems in advance; to structure programs so that unanticipated problems do not lead to catastrophic consequences, and when problems do arise, they can /debug/ their programs.
- interpreter :: an /interpreter/ is a machine that carries out processes decribed in a programming language.
** The Elements of Programming
   :LOGBOOK:
   CLOCK: [2021-11-09 Tue 11:43]--[2021-11-09 Tue 13:49] =>  2:06
   CLOCK: [2021-11-07 Sun 12:34]--[2021-11-07 Sun 13:09] =>  0:35
   CLOCK: [2021-07-13 Tue 17:41]--[2021-07-13 Tue 21:21] =>  3:40
   CLOCK: [2021-07-13 Tue 16:46]--[2021-07-13 Tue 17:41] =>  0:55
   :END:
- A powerful programming language is more than just a means for the /prescription/ of computational processes. It is a framework within which we organize our ideas about computational processes.
- Every powerful language provides three mechanisms to combine simple ideas to form more complex ideas:
 - primitive expressions :: the simplest entities the language is concerned with
 - means of combination :: compound elements are built from simpler ones
 - means of abstraction :: compound elements can be named and manipulated as units
- In programming, we deal with two kinds of elements: /*procedures*/ and /*data*/. Informally, data is "stuff" that we want to manipulate, and procedures are descriptions of the rules for manipulating the data. *Thus any powerful programming language should be able to describe /primitive data/ and /primitive procedures/ and should have methods for /combining/ and /abstracting/ procedures and data.*
** Procedures and the Processes They Generate
   :LOGBOOK:
   CLOCK: [2021-11-09 Tue 18:25]--[2021-11-09 Tue 19:39] =>  1:14
   CLOCK: [2021-11-09 Tue 16:42]--[2021-11-09 Tue 17:54] =>  1:12
   CLOCK: [2021-11-07 Sun 16:16]--[2021-11-07 Sun 17:19] =>  1:03
   CLOCK: [2021-11-07 Sun 14:28]--[2021-11-07 Sun 16:04] =>  1:36
   :END:
- A procedure is a pattern for the /local evolution/ of a computational process. It specifies how each stage of the process is built upon the previous stage.
- We would like to be able to make statements about the /global/ behaviour of the process whose local evolution has been specified by a procedure.
** Formulating Abstractions with Higher-Order Procedures
   :LOGBOOK:
   CLOCK: [2021-11-07 Sun 22:51]--[2021-11-08 Mon 00:26] =>  1:35
   :END:
* Building Abstractions with Data
  :LOGBOOK:
  CLOCK: [2021-11-08 Mon 00:45]--[2021-11-08 Mon 01:01] =>  0:16
  :END:
** Introduction to Data Abstraction
   :LOGBOOK:
   CLOCK: [2021-11-08 Mon 01:01]--[2021-11-08 Mon 01:26] =>  0:25
   :END:
** Hierarchical Data and the Closure Property
   :LOGBOOK:
   CLOCK: [2021-11-09 Tue 07:22]--[2021-11-09 Tue 08:23] =>  1:01
   :END:
